app/controllers/autenticacaos_controller.rb

SELECT * FROM `clientes` WHERE (`clientes`.`senha` = '1234567' AND `clientes`.`nome` = 'jose') LIMIT 1
---
  def create

    cliente = Cliente.find_by_nome_and_senha(params[:login], params[:senha])