app/controllers/comentarios_controller.rb

SELECT * FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def show
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-07-06 23:53:57', 'texto para comentário', 'restaurante', 1, '2010-07-06 23:53:57')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|

      if @comentario.save

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
DELETE FROM `comentarios` WHERE `id` = 1
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy