app/controllers/nomes_controller.rb

SELECT * FROM `nomes`
---
  def index
    @nomes = Nome.all

SELECT * FROM `nomes` WHERE (`nomes`.`id` = 1)
---
  def show
    @nome = Nome.find(params[:id])

SELECT * FROM `nomes` WHERE (`nomes`.`id` = 1)
---
  def edit
    @nome = Nome.find(params[:id])

INSERT INTO `nomes` (`updated_at`, `nome`, `created_at`) VALUES('2010-07-06 01:11:34', 'joao', '2010-07-06 01:11:34')
---
  def create
    @nome = Nome.new(params[:nome])

    respond_to do |format|
      if @nome.save

SELECT * FROM `nomes` WHERE (`nomes`.`id` = 1)
UPDATE `nomes` SET `nome` = 'joao carlos', `updated_at` = '2010-07-06 01:11:42' WHERE `id` = 1
---
  def update
    @nome = Nome.find(params[:id])

    respond_to do |format|
      if @nome.update_attributes(params[:nome])