app/controllers/qualificacoes_controller.rb

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
---
  def new
    @qualificacao = Qualificacao.new
    respond_to do |format|
    format.html # new.html.erb
    format.xml  { render :xml => @qualificacao }

    if params[:cliente]
       @qualificacao.cliente = Cliente.find(params[:cliente])
    end
    if params[:restaurante]
       @qualificacao.restaurante = Restaurante.find(params[:restaurante])