app/controllers/restaurantes_controller.rb

 def index
#  @restaurante = Restaurante.find(:all, :order => "nome")
   @restaurante = Restaurante.paginate :page => params['page'], :per_page=>2  #usando a gem will_paginate
---
SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`

 def create
  @restaurante = Restaurante.new(params[:restaurante])
  if @restaurante.save
---
INSERT INTO `restaurantes` (`updated_at`, `especialidade`, `endereco`, `nome`, `telefone`, `created_at`) VALUES('2010-07-07 00:00:00', 'italiana', 'av restaurantes', 'Fasano', NULL, '2010-07-07 00:00:00')

 def edit
  @restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)